1.Get the unique values from a column in Pandas DataFrame.
2. Create a new column in Pandas DataFrame after applying a 10% raise on the existing ‘Cost’ column.
3. Display the frequency counts of only the first column elements in Pandas DataFrame.
4. Get the index of minimum and maximum values in the DataFrame columns.

In [2]:
import pandas as pd

## 1.Get the unique values from a column in Pandas DataFrame.

In [8]:
arr=pd.read_csv('data.csv', header=None)

In [9]:
arr

   0  1
0  1  2
1  1  3
2  1  4
3  2  1
4  2  1
5  3  1

In [10]:
type(arr)

pandas.core.frame.DataFrame

In [16]:
arr[0].unique()

array([1, 2, 3], dtype=int64)

In [17]:
arr[1].unique()

array([2, 3, 4, 1], dtype=int64)

## 2. Create a new column in Pandas DataFrame after applying a 10% raise on the existing ‘Cost’ column.

In [18]:
obj=pd.read_csv('cost.csv')

In [19]:
obj

   cost
0    10
1   100
2  1000

In [20]:
type(obj)

pandas.core.frame.DataFrame

In [21]:
obj['cost_10%_high']=obj['cost']*1.1

In [22]:
obj

   cost  cost_10%_high
0    10           11.0
1   100          110.0
2  1000         1100.0

## 3. Display the frequency counts of only the first column elements in Pandas DataFrame.

In [23]:
arr

   0  1
0  1  2
1  1  3
2  1  4
3  2  1
4  2  1
5  3  1

In [24]:
arr[0].value_counts()

1    3
2    2
3    1
Name: 0, dtype: int64

## 4. Get the index of minimum and maximum values in the DataFrame columns.

In [25]:
arr

   0  1
0  1  2
1  1  3
2  1  4
3  2  1
4  2  1
5  3  1

In [27]:
arr.idxmax()

0    5
1    2
dtype: int64

In [28]:
arr.idxmin()

0    0
1    3
dtype: int64